<div class="alert alert-block alert-success">
    <h1 align="center">Pandas Trick 22</h1>
    <h3 align="center">Moving Columns in Pandas</h3>
    <h4 align="center"><a href="http://www.iran-machinelearning.ir">Soheil Tehranipour</a></h5>
</div>

### Importing the libraries

In [3]:
import pandas as pd;

In [2]:
pd.__version__

'1.5.1'

## Make Dataframe

In [5]:
d = {"A":[15, 20], "B":[20, 25], "C":[30 ,40], "D":[50, 60]}
df = pd.DataFrame(d)
df

    A   B   C   D
0  15  20  30  50
1  20  25  40  60

In [6]:
# Using insert
df.insert(3, "C2", df["C"]*2)
df

    A   B   C  C2   D
0  15  20  30  60  50
1  20  25  40  80  60

In [7]:
# Other solution
df["C3"] = df["C"]*3 # create a new columns, it will be at the end

columns = df.columns.to_list() # create a list with all columns
location = 4 # specify the location where you want your new column

columns = columns[:location] + ["C3"] + columns[location:-1] # reaarange the list
df = df[columns] # create te dataframe in with the order of columns you like
df

    A   B   C  C2   C3   D
0  15  20  30  60   90  50
1  20  25  40  80  120  60

<img src="https://webna.ir/wp-content/uploads/2018/08/%D9%85%DA%A9%D8%AA%D8%A8-%D8%AE%D9%88%D9%86%D9%87.png" width=50% />